import 'package:flutter/material.dart';

class QuestionNasbeAnten {
  final List<Map<String, dynamic>> Questionnaire = [
    {
      "question": "در کدام یک از خدمات آنتن میتوانیم کمکتان کنیم ؟",
      "type": "radio",
      "answers": [
        'آنتن مرکزی',
        'آنتن معمولی',
        'نمیدانم',
      ],
    },
    {
      "question": "در چه زمینه ای از آنتن مرکزی کمک نیاز دارید؟",
      "type": "radio",
      "answers": [
        'عیب یابی آنتن مرکزی',
        'نصب و راه اندازی آنتن مرکزی',
        'سیم کشی آنتن مرکزی (نیاز به بازدید حضوری متخصص)',
      ],
    },
    {
      "question": "مشکل خود را وارد کنید",
      "type": "radio",
      "answers": [
        'سیم آنتن خراب است',
        'آنتن خراب است',
      ],
    },
    {
      "question": "نوع سیم کشی خود را وارد کنید",
      "type": "radio",
      "answers": [
        'سیم کشی توکار دارم',
        'سیم کشی روکار دارم',
      ],
    },
    {
      "question": "آیا نیاز به سیم آنتن دارید؟",
      "type": "radio",
      "answers": [
        'بله نیاز به سیم آنتن دارم',
        'خیر نیاز به سیم آنتن ندارم',
      ],
    },
    {
      "question": "گزینه مورد نظر خود را وارد کنید",
      "type": "radio",
      "answers": [
        'عیب یابی',
        'سیم کشی ( نیاز به بازدید حضوری متخصص)',
        'نصب و راه اندازی',
      ],
    },
    {
      "question": "مشکل خود را انتخاب کنید",
      "type": "radio",
      "answers": [
        'آنتن ما خراب است',
        'سیم آنتن قطع است',
        'شبکه پرپر میزند (تِرَک تِرَک)',
        'آنتن ما قطع شده است (شبکه نداریم)',
        'آنتن ضعیف است (بعضی از شبکه ها قطع است)',
      ],
    },
    {
      "question": "آیا نیاز به سیم کشی دارید؟",
      "type": "radio",
      "answers": [
        'بله نیاز دارم(نیازمند به بازدید حضوری متخصص )',
        'خیر نیاز ندارم',
      ],
    },
    {
      "question": "متراژ سیم خود را تعیین کنید",
      "type": "textfield",
      "answers": [
        'متراژ سیم کشی (اجرت و محصول) (21000 ریال)',
      ],
    },
  ];
}
